<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\AreaModel;

class AreaSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {   
        $areas = [
            ["name" => "Автогарата"], ["name" => "Аспарухово"], ["name" => "Бриз"], ["name" => "Виница"], ["name" => "ВИНС"], ["name" => "Владиславово"], ["name" => "Военна Болница"], ["name" => "Възраждане"], ["name" => "Галата"], ["name" => 
            "Генералите"], ["name" => "Гранд Мол"], ["name" => "Гръцки квартал"], ["name" => "Дружба"], ["name" => "Електрон"], ["name" => "ЖП Гара"], ["name" => "Западна Промишлена Зона"], ["name" => "ЗК Тракия"], ["name" => 
            "Идеален Център"], ["name" => "Изгрев"], ["name" => "Кайсиева Градина"], ["name" => "Колхозен Пазар"], ["name" => "Конфуто"], ["name" => "Левски"], ["name" => "Летище"], ["name" => "ЛК Тракия"], ["name" => 
            "Младост"], ["name" => "Морска Градина"], ["name" => "Нептун"], ["name" => "Нов Хлебозавод"], ["name" => "Общината"], ["name" => "Окръжна Болница"], ["name" => "Пикадили"], ["name" => "Победа"], ["name" => 
            "Погребите"], ["name" => "Промишлена Зона Метро"], ["name" => "Промишлена Зона Планова"], ["name" => "Траката"], ["name" => "Северна Промишлена Зона"], ["name" => "Спортна Зала"], ["name" => 
            "Техникумите"], ["name" => "Трошево"], ["name" => "ХЕИ"], ["name" => "Христо Ботев"], ["name" => "Цветен"], ["name" => "Център"], ["name" => "Чайка"], ["name" => "Чаталджа"], ["name" => "Червен Площад"], ["name" => 
            "Южна Промишлена Зона"], ["name" => "м-т Ален мак"], ["name" => "м-т Кабакум"]
        ];

        foreach ($areas as $area) {
            AreaModel::create($area);
        }
        
    }
}
